Class-Documents/Proposal.tex
% Created 2024-01-24 Wed 09:13
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Christian Johnson \and Daniel Nusraty \and Dylan McGill \and \newline Mailroom 2.0}
\date{\today}
\title{Mailroom Package Tracker}
\hypersetup{
 pdfauthor={Christian Johnson \and Daniel Nusraty \and Dylan McGill \and \newline Mailroom 2.0},
 pdftitle={Mailroom Package Tracker},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2.50 (Org mode 9.7-pre)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{document}
\newpage
\section{Team Agreement}
\label{sec:org0bd1bab}
We will meet weekly in Macallister Hall.
In the event that we are unable to meet, we will reschedule as needed.
If there is a disagreement on implementation, we will attempt to reach a compromise. If one is not possible, the offending parties will each branch the project and attempt to implement their idea, comparing progress and choosing the more effective solution at the time of the next meeting.
\section{Background}
\label{sec:orga54a047}
The cadet mailroom receives hundreds of packages a week.
Currently, this involves manually scanning, sorting, and distributing notices for each of these packages.
This workflow could easily be reduced using software to track the addresee and mailbox of the package
\section{Vision Statement}
\label{sec:orgaac9556}
\begin{itemize}
\item Store information in 2 databases.
\begin{enumerate}
\item to hold cadet info - Name, Box \#, Email Address, Graduation Year. This information can be pulled from regis.
\item to hold package info - tracking number, addressee, received date, picked up date
\end{enumerate}
\item Easy entry. Enter addressee and tracking number.
Program will record \#, name, date - send email to addressee.
\item Search. Enter cadet name or mailbox number, see if there are any packages.
\item Retrieval. Search cadet name, find package by tracking number, mark as picked up.
\end{itemize}

Mailroom staff already uses a system that involves scanners to read a packages tracking number. We would not need to integrate with that existing system.
They could simply read the tracking number with their scanners, then enter manually. 
\section{Meetings}
\label{sec:orgac5c4a9}
\subsection{Meeting One}
\label{sec:org67e134b}
Identified group members - Dan, Christian, Dylan
Identified prospective project - Mailroom tracking system
\subsection{Meeting two}
\label{sec:org3e52e55}
Brainstormed ideas for project, created general outline.
\subsection{Meeting three}
\label{sec:orgc76fad0}
Adjusted plan and removed some anticipated functionality. 
\end{document}
\end{document}